================================================================================
Block comment
================================================================================

/*
 * Testing block comment
 */

--------------------------------------------------------------------------------

(source_file
  (block_comment
    (block_comment_text)))

================================================================================
Singleline Doc comment
================================================================================
<* Single doc text *>

--------------------------------------------------------------------------------

(source_file
  (doc_comment
    (doc_comment_text)))

================================================================================
Multiline Doc comment
================================================================================
<*
Multiple line doc
Another line
*>

--------------------------------------------------------------------------------

(source_file
  (doc_comment
    (doc_comment_text)))

================================================================================
Param Doc comment
================================================================================
<*
 @param foo "text"
*>

--------------------------------------------------------------------------------

(source_file
  (doc_comment
    (doc_comment_contract
      (at_ident)
      (ident)
      (string_expr
        (string_literal
          (string_content))))))

================================================================================
Param Doc 2 comments
================================================================================
<*
 @param foo : "text"
 @param [&in] bar : `text` "text"
 @param [&in] bar
   : `text` "text"
 @param [&in] bar :
   `text` "text"
 @param [&in] bar
   :
   `text`
   "text"
*>

--------------------------------------------------------------------------------

(source_file
  (doc_comment
    (doc_comment_contract
      (at_ident)
      (ident)
      (string_expr
        (string_literal
          (string_content))))
    (doc_comment_contract
      (at_ident)
      (doc_comment_contract_descriptor)
      (ident)
      (string_expr
        (raw_string_literal
          (raw_string_content))
        (string_literal
          (string_content))))
    (doc_comment_contract
      (at_ident)
      (doc_comment_contract_descriptor)
      (ident)
      (string_expr
        (raw_string_literal
          (raw_string_content))
        (string_literal
          (string_content))))
    (doc_comment_contract
      (at_ident)
      (doc_comment_contract_descriptor)
      (ident)
      (string_expr
        (raw_string_literal
          (raw_string_content))
        (string_literal
          (string_content))))
    (doc_comment_contract
      (at_ident)
      (doc_comment_contract_descriptor)
      (ident)
      (string_expr
        (raw_string_literal
          (raw_string_content))
        (string_literal
          (string_content))))))

================================================================================
Require Doc
================================================================================
<*
 @require new_size == 0 || self.capacity != 0, foo()
*>

--------------------------------------------------------------------------------

(source_file
  (doc_comment
    (doc_comment_contract
      (at_ident)
      (binary_expr
        (binary_expr
          (ident_expr
            (ident))
          (integer_literal))
        (binary_expr
          (field_expr
            (ident_expr
              (ident))
            (access_ident
              (ident)))
          (integer_literal)))
      (call_expr
        (ident_expr
          (ident))
        (call_arg_list)))))

================================================================================
Require Doc single line
================================================================================
<* @require foo == 0 *>

--------------------------------------------------------------------------------

(source_file
  (doc_comment
    (doc_comment_contract
      (at_ident)
      (binary_expr
        (ident_expr
          (ident))
        (integer_literal)))))

================================================================================
Doc compound
================================================================================
<*
 A document
 @param foo : "text"
 @param [&in] bar : `text`
 @pure
 @something "with text"
*>

--------------------------------------------------------------------------------

(source_file
  (doc_comment
    (doc_comment_text)
    (doc_comment_contract
      (at_ident)
      (ident)
      (string_expr
        (string_literal
          (string_content))))
    (doc_comment_contract
      (at_ident)
      (doc_comment_contract_descriptor)
      (ident)
      (string_expr
        (raw_string_literal
          (raw_string_content))))
    (doc_comment_contract
      (at_ident))
    (doc_comment_contract
      (at_ident)
      (string_expr
        (string_literal
          (string_content))))))

================================================================================
Doc compound 2
================================================================================
<* A document
  @require foo == 0 *>

--------------------------------------------------------------------------------

(source_file
  (doc_comment
    (doc_comment_text)
    (doc_comment_contract
      (at_ident)
      (binary_expr
        (ident_expr
          (ident))
        (integer_literal)))))

================================================================================
Doc @ inside doc
================================================================================
<*
 A document @param -- must be ignored
   also @this
 @param foo "text"
 @param [&in] bar `text`
*>

--------------------------------------------------------------------------------

(source_file
  (doc_comment
    (doc_comment_text)
    (doc_comment_contract
      (at_ident)
      (ident)
      (string_expr
        (string_literal
          (string_content))))
    (doc_comment_contract
      (at_ident)
      (doc_comment_contract_descriptor)
      (ident)
      (string_expr
        (raw_string_literal
          (raw_string_content))))))

================================================================================
Empty doc
================================================================================
<**>

--------------------------------------------------------------------------------

(source_file
  (doc_comment))

================================================================================
Error doc
:error
================================================================================
<*
 Hello
 @require a != 0
 More text?
*>

--------------------------------------------------------------------------------


